In [3]:
from pandas import Series
series1 = Series([1,2,3,4,5])
series2 = Series([100,200,300,400,500,600])
series1 + series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [4]:
from pandas import DataFrame
data1 = {'Speed': [100,103,105],
        'Temp': [34,23,42]}
frame1 = DataFrame(data1)

In [5]:
fram1

NameError: name 'fram1' is not defined

In [6]:
frame1

   Speed  Temp
0    100    34
1    103    23
2    105    42

In [9]:
from pandas import DataFrame
data2 = {'Speed': [100,103,105],
        'Temp': [34,23,42],
        'Humidity': [45,23,48]
        }
frame2 = DataFrame(data2)
frame2

   Humidity  Speed  Temp
0        45    100    34
1        23    103    23
2        48    105    42

In [10]:
frame1 + frame2

   Humidity  Speed  Temp
0       NaN    200    68
1       NaN    206    46
2       NaN    210    84

In [11]:
series

NameError: name 'series' is not defined

In [13]:
series2 = Series([100,200,300], index=['Speed','Temp','Humidity'])
series2

Speed       100
Temp        200
Humidity    300
dtype: int64

In [14]:
4300000000 * .02

86000000.0

In [15]:
frame2

   Humidity  Speed  Temp
0        45    100    34
1        23    103    23
2        48    105    42

In [16]:
fram2 - series2

NameError: name 'fram2' is not defined

In [17]:
frame2 - series2

   Humidity  Speed  Temp
0      -255      0  -166
1      -277      3  -177
2      -252      5  -158

In [22]:
series3 = Series([100,200], index=['Speed','Temp'])

In [19]:
series3

Speed       100
Temp        200
Humidity    300
dtype: int64

In [20]:
frame2 + series3

   Humidity  Speed  Temp
0       345    200   234
1       323    203   223
2       348    205   242

In [23]:
frame2 + series3

   Humidity  Speed   Temp
0       NaN  200.0  234.0
1       NaN  203.0  223.0
2       NaN  205.0  242.0

In [25]:
ser = Series([3,7,5,3,45,2], index=[2,3,6,43,21,3])
ser

2      3
3      7
6      5
43     3
21    45
3      2
dtype: int64

In [26]:
ser.sort_index()

2      3
3      7
3      2
6      5
21    45
43     3
dtype: int64

In [27]:
data2

{'Humidity': [45, 23, 48], 'Speed': [100, 103, 105], 'Temp': [34, 23, 42]}

In [28]:
frame2

   Humidity  Speed  Temp
0        45    100    34
1        23    103    23
2        48    105    42

In [29]:
frame2 = frame2.reindex([2,1,0])
frame2

   Humidity  Speed  Temp
2        48    105    42
1        23    103    23
0        45    100    34

In [30]:
frame2.sort_index()

   Humidity  Speed  Temp
0        45    100    34
1        23    103    23
2        48    105    42

In [34]:
frame2 = frame2.reindex(columns=['Speed','Humidity','Temp'])
frame2

   Speed  Humidity  Temp
2    105        48    42
1    103        23    23
0    100        45    34

In [35]:
frame2.sort_index(axis=1)

   Humidity  Speed  Temp
2        48    105    42
1        23    103    23
0        45    100    34